Revit 2027 API
FabricationConfiguration.GetMaterialGaugeByGUID Method
 Gets the material gauge identifier by its GUID and material identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetMaterialGaugeByGUID(
	Guid gaugeGUID,
	int materialId
)
Public Function GetMaterialGaugeByGUID (
	gaugeGUID As Guid,
	materialId As Integer
) As Integer
public:
int GetMaterialGaugeByGUID(
	Guid gaugeGUID,
	int materialId
)
member GetMaterialGaugeByGUID :
        gaugeGUID : Guid *
        materialId : int -> int
Parameters
gaugeGUID Guid
 The material gauge GUID.
materialId Int32
 The material identifier. The same material gauge GUID could have different material gauge identifiers for different materials.
Return Value
Int32
 The gauge identifier. Returns 0 if not found.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace